name: "test_ReLU"
input: "input"

input_dim: 2
input_dim: 6
input_dim: 75
input_dim: 113

layer {
  type: "ReLU"
  name: "prelu"
  bottom: "input"
  top: "prelu"
  relu_param {
    negative_slope: -0.3
  }
}

layer {
  type: "ReLU"
  name: "output"
  bottom: "prelu"
  top: "output"
}
